{
   "name": "Samrat",
   "lastname": "Dutta",
   "tagline": "Cloud Computing Engineer",
   "contact": {
      "email": "samratdutta079@gmail",
      "phone": "+91 835-698-2930",
      "linkedin": "samratdutta3597",
      "github": "Samrat079",
      "website": "samrat079.github.io"
   },

   "about": "Experienced Cloud Computing Engineer with a strong background in backend infrastructure, home labbing, and self-hosting. Proficient in tools like Docker, Docker Compose, Kubernetes, Terraform, NGINX, and Apache. Skilled in automating application deployments and managing cloud-native and self-hosted services. Demonstrated adaptability through hands-on experience migrating between platforms (e.g., Supabase to Firebase) under hardware constraints. Passionate about optimizing systems and building efficient, scalable backend solutions.",
   "education": [
      {
         "degree": "B.A.hons",
         "university": "Techno India University",
         "time": "2021 - 2024"
      }
   ],
   "experience": [
      {
         "role": "AWS EC2 engineer",
         "company": "Digital Squares",
         "time": "03/2024 - 02/2025",
         "details": [
            "Deploying and maintaining server infrastructures by using softwares like Terraform.",
            "Implimenting automatic features like container build, run, stop and kill.",
            "Ensuring optimized load balancing reducing stress nodes.",
            "Configuring amazon linux for maximum performance"
         ]
      },
      {
         "role": "Cloud engineer",
         "company": "Hun Digital",
         "time": "06.2023 - 01.2024",
         "details": [
            "Undertaking serverless deployment with Vercel and Docker, ensuring easy quick deployment while avoiding vendor lock in",
            "Reducing server costs by running highly stripped down and optimized containers.",
            "Implimenting up-time optimizations to maintaining minimum operational capacity ensuring cost effective deployment."
         ]
      },
      {
         "role": "Backend engineer",
         "company": "(Open Source)",
         "time": "05.2023",
         "details": [
            "Migrating database from firebase to supabase.",
            "Implimenting maximum compatablity with PostgreSQL to ensure high speed speed data fetching",
            "Implimenting high quality auth and data hash function."
         ]
      }
   ],
   "projects": {
      "details": "Find the links to all my projects by visiting my portfolio at samrat079.github.io/Portfolio/",
      "items": [
         {
            "name": "Bashmark",
            "tagline": "[C++, OpenCL]",
            "link": "github.com/Samrat079/Bashmark",
            "details": "Bashmark is a terminal utility which allows for hardware benchmarking to be performed from within the terminal of the system. It uses OpenCL a open source graphics library to undetake GPU benchmarking by performing matrix multiplication. Bashmark is compatable with linux and macOS systems."
         },
         {
            "name": "Fractal Benchmark",
            "tagline": "[WebGL, expressJS]",
            "link": "samrat079.github.io/Fractal_Benchmark/",
            "details": "Fractal Benchmark is a ray marching implimentation of a mandelbulb renderer using webGL, It is able to render a mandelbulb from within the browser. Due to the gpu intensive nature of the render it can be used for system benchmarking. It also comes with UI eliments to help with performing the system checks."
         },
         {
            "name": "Stall Speed Calculator",
            "tagline": "[expressJS]",
            "link": "samrat079.github.io/stall_speed_calculator/",
            "details": "Stall speed calculator is a web based calculator which is able to determinal the stalling speed of a aerofoil with the given inputs altitude, Wing Loading and Lift Coefficient. This calculator is far easier to use as it takes away the need for educated guess about the weight and the bank angle calculations by simply replacing them with wing loading which is a much more consistant metric."
         }
      ]
   },
   "skills2Rows": false,
   "skills": [
      {
         "name": "Docker/kubernetes",
         "level": 4.5
      },
      {
         "name": "Bash/zsh/fish",
         "level": 5
      },
      {
         "name": "Nginx/Apache",
         "level": 5
      },
      {
         "name": "Linux (Ubuntu, Amazon Linux/Red Hat)",
         "level": 4
      },
      {
         "name": "AWS (EC2, S3)",
         "level": 4.5
      },
      {
         "name": "DB (Firebase, Superbase, Pocketbase)",
         "level": 5
      },
      {
         "name": "Git",
         "level": 4
      }
   ],
   "languages": [
      {
         "name": "English"
      }
   ],

   "interests": [
      {
         "name": "Self Hosting"
      },
      {
         "name": "Gaming"
      }
   ],
   "numerPages": true
}